{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 60, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "share_conv_1", "class_name": "Conv2D", "config": {"name": "share_conv_1", "trainable": true, "filters": 20, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]]}, {"name": "max_pooling_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["share_conv_1", 0, 0, {}]], [["share_conv_1", 1, 0, {}]], [["share_conv_2", 0, 0, {}]], [["share_conv_2", 1, 0, {}]], [["conv_5", 0, 0, {}]], [["conv_6", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 60, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "share_conv_2", "class_name": "Conv2D", "config": {"name": "share_conv_2", "trainable": true, "filters": 25, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling_1", 0, 0, {}]], [["max_pooling_1", 1, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\b\u0000\u0000\u0000\t\u0000\u0000\u0000S\u0000\u0000\u0000s\u00be\u0000\u0000\u0000t\u0000j\u0001|\u0000d\bd\u0002\u008d\u0002}\u0001t\u0000j\u0002|\u0000\u0083\u0001d\u0003\u0019\u0000}\u0002t\u0000j\u0002|\u0000\u0083\u0001d\u0001\u0019\u0000}\u0003g\u0000}\u0004g\u0000}\u0005x|t\u0003d\u0001|\u0002d\u0001\u0017\u0000\u0083\u0002D\u0000]j}\u0006xLt\u0003d\u0001|\u0003d\u0001\u0017\u0000\u0083\u0002D\u0000]:}\u0007|\u0005j\u0004|\u0001d\u0000d\u0000\u0085\u0002|\u0006d\u0001\u0018\u0000|\u0006d\u0004\u0017\u0000\u0085\u0002|\u0007d\u0001\u0018\u0000|\u0007d\u0004\u0017\u0000\u0085\u0002d\u0000d\u0000\u0085\u0002f\u0004\u0019\u0000\u0083\u0001\u0001\u0000qVW\u0000|\u0004j\u0004t\u0000j\u0005|\u0005d\u0001d\u0005\u008d\u0002\u0083\u0001\u0001\u0000g\u0000}\u0005qBW\u0000t\u0000j\u0005|\u0004d\u0003d\u0005\u008d\u0002S\u0000)\tN\u00e9\u0002\u0000\u0000\u0000)\u0001\u00da\u0007padding\u00e9\u0001\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000)\u0001\u00da\u0004axis\u00a9\u0002r\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00a9\u0002r\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000)\u0002r\u0006\u0000\u0000\u0000r\u0007\u0000\u0000\u0000)\u0006\u00da\u0001K\u00da\u0012spatial_2d_padding\u00da\tint_shape\u00da\u0005range\u00da\u0006append\u00da\u000bconcatenate)\b\u00da\u0007input_x\u00da\u000binput_x_pad\u00da\bx_length\u00da\by_length\u00da\routput_x_list\u00da\routput_y_list\u00da\u0003i_x\u00da\u0003i_y\u00a9\u0000r\u0016\u0000\u0000\u0000\u00fa4E:/Uni/Level_5_Project/Tracker/re_id/cuhk03/model.py\u00da\u001aupsample_neighbor_function&\u0000\u0000\u0000s\u0016\u0000\u0000\u0000\u0000\u0001\u000e\u0001\u000e\u0001\u000e\u0001\u0004\u0001\u0004\u0001\u0014\u0001\u0014\u0001:\u0001\u0014\u0001\b\u0001", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["max_pooling_1", 2, 0, {}]], [["max_pooling_1", 3, 0, {}]]]}, {"name": "upsample_1", "class_name": "UpSampling2D", "config": {"name": "upsample_1", "trainable": true, "size": [5, 5], "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling_1", 2, 0, {}]], [["max_pooling_1", 3, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000S\u0000\u0000\u0000s\u0006\u0000\u0000\u0000|\u0000\u000b\u0000S\u0000)\u0001N\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa4E:/Uni/Level_5_Project/Tracker/re_id/cuhk03/model.py\u00da\b<lambda>J\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_1", 1, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["upsample_1", 0, 0, {}], ["lambda_2", 1, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["upsample_1", 1, 0, {}], ["lambda_2", 0, 0, {}]]]}, {"name": "conv_3", "class_name": "Conv2D", "config": {"name": "conv_3", "trainable": true, "filters": 25, "kernel_size": [5, 5], "strides": [5, 5], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "conv_4", "class_name": "Conv2D", "config": {"name": "conv_4", "trainable": true, "filters": 25, "kernel_size": [5, 5], "strides": [5, 5], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv_5", "class_name": "Conv2D", "config": {"name": "conv_5", "trainable": true, "filters": 25, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv_3", 0, 0, {}]]]}, {"name": "conv_6", "class_name": "Conv2D", "config": {"name": "conv_6", "trainable": true, "filters": 25, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv_4", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["max_pooling_1", 4, 0, {}], ["max_pooling_1", 5, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.0.5", "backend": "tensorflow"}